# -*- coding: utf-8 -*-
# 12. 数据容器-str
# 知识点：字符串不可变、有序性、下标取值；count / index / replace / isdigit / join / split

# ==================== 字符串 str：不可变、有序性 ====================
a = "明天中午12点放假,1.5天"
print(a[0])                         # 打印第1个字符
print(a[-1])                        # 打印倒数第1个字符
print(a[6])                         # 打印第7个字符

# ==================== 对象函数（字符串常用方法） ====================
# .count 函数
# 公式：变量名.count('关键字')
# 说明：统计这个关键字出现的次数
# .index 函数
# 公式：变量名.index('关键字')
# 说明：查找字符串、元组、列表在数据中的下标位置
# .replace 函数
# 公式：变量名.replace('替换之前的内容', '新内容')
# 说明：将字符串内容进行替换，用于字符串 str 类型
# 注意：replace 替换之后的结果，如果直接打印是不会有变化的，
#       需要重新赋值给一个新的变量名，打印新的变量名才是最后修改之后的内容
shi = '今天是星期六'
y = shi.replace('今天是', '星期五')
print(y)

# .isdigit 函数
# 说明：isdigit 函数判断字符串是不是纯数字，如果是纯数字返回 True，如果不是纯数字返回 False
# 注意：判断对象内容必须是字符串
str1 = '123'
print(str1.isdigit())           # 纯数字，结果是 True
str2 = '123你好'
print(str2.isdigit())           # 有中文，结果是 False
str3 = '123.00'
print(str3.isdigit())           # 有小数点，结果是 False

# .join 函数
# 说明：join 是用来做字符串拼接的，中间可以加符号拼接出结果
# 公式：'输入你想要拼接的符号'.join(变量名)
a = ('1234567', '23456', '5676', '3456')
print(a)
print('-'.join(a))

# .split 函数
# 说明：用来做字符串分割，使用某一个关键字作为分割符号
# 公式：变量名.split('需要用来分割的内容')
a = ('12345678765432167895043267843212')
print(a)
print(a.split('6'))
