# -*- coding: utf-8 -*-
# 13. 数据容器-tuple
# 知识点：元组定义（有序、不可修改）、下标与切片查询

# ==================== tuple 元组 () ====================
# 说明：元组是一个有序的集合，可以通过下标访问数据，元组里面可以存放任意的数据类型
# 特点：
#   1. 有序的数据类型，可以通过下标查找
#   2. 可以存放任意的数据：整数、浮点型、字符串、布尔等
#   3. 不可以修改、删除、新增，只能查询
# 公式：变量名 = (数据1, 数据2, 数据3 ...)
# 公式：变量名 = 数据1, 数据2, 数据3 ...
E = (1, '电脑', '屏幕', '石', True,)
print(E, type(E))

# ==================== 查询数据 ====================
# 说明：tuple 因为是有序的，所以可以通过下标去查询信息，索引从 0 开始计数
# 公式：
#   查询单个数据：元组名[下标]
#   查询多个数据：元组名[起始下标 : 结束位置]
#   查询多个数据：元组名[起始下标 : 结束位置 : 步长]
# 注意：下标从 0 开始数，每一个逗号相当于间隔，逗号不参与计数；找不到会报错
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]                  # 定义 a 变量，存储一个元组
print(a[0])                               # 第一个数据
print(a[-1])                              # 最后一个数据
print(a[0:8])                             # 查询第 1-8 个数据
print(a[20:36])                           # 查询第 21-36 个数据
print(a[15:46])                           # 查询第 16-46 个数据
print(a[::3])                             # 打印 a 元组中的数据，跨度为 3
print(a[::-1])                            # 逆序打印 a 元组的内容，从最后一个开始打印到第一个
