# -*- coding: utf-8 -*-
# 14. 数据容器-set
# 知识点：集合定义（无序、自动去重）、add / update 添加、remove / clear 删除

# ==================== set 集合 {} ====================
# 说明：set 集合是一个无序的且不重复的数据集合，数据会自动去重，会去掉重复数据
# 特点：
#   1. 无序的数据类型，不可以通过下标查找
#   2. 可以存放任意的数据：整数、浮点型、字符串、布尔等
#   3. 可以增、删、查询，但是不能修改单个元素
#   4. 元素唯一，可以自动去重
# 公式：变量名 = {数据1, 数据2, 数据3 ...}
Q = {1, '石', '石', True, 2, '你好'}
print(Q, type(Q))

# ==================== 添加数据 ====================
# .add 添加单个数据
# 公式：变量名.add(值)
# 说明：因为是无序的关系，所有添加后的数据，打印时会随机排序
Q.add('小石')
print(Q)
# .update 添加多个数据
# 公式：变量名.update([数据1, 数据2, 数据3 ...])
Q.update('你', '老弟', '哈哈哈')
print(Q)

# ==================== 删除数据 ====================
# .remove 删除指定数据
# 公式：变量名.remove(值)
# 说明：根据值来删除，如果删除不存在的值，会导致报错
Q.remove(2)
print(Q)
# .clear 删除所有数据
# 公式：变量名.clear()
Q.clear()
print(Q)

# 补充：pop() 删除指定位置的值，默认最后一个；sort() 排列；reverse 反转
